rime.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-04-12 Sun 12:18 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>RIME Input Method Engine (RIME)</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">RIME Input Method Engine (RIME)</h1>
<p>
<a href="https://rime.im">Rime input method engine (RIME)</a> is an excellent input method application, which can be run on a variety of platforms, e.g., Linux, MacOS, and Windows.
</p>

<p>
RIME does not come with a frontend. Therefore, RIME as well as its frontend (e.g., <code>fcitx5</code> or <code>ibus</code>) can be installed together.
</p>
<div class="org-src-container">
<pre class="src src-sh"><code>pacman -S librime fcitx5-im
</code></pre>
</div>

<p>
Among the RIME solutions, <code>wanxiang</code> is a good choice. On ArchLinux, it can be easily installed by
</p>
<div class="org-src-container">
<pre class="src src-sh"><code>yay -S rime-wanxiang-updater
</code></pre>
</div>
<p>
After the installation, run <code>rime-wanxiang-updater</code> to update the data and complete the configuration.
</p>

<p>
Besides setting the environment variables (referred to <a href="hyprland.html">hyprland</a>), another configuration file for further customization is necessary, e.g.,
</p>
<ul class="org-ul">
<li><p>
<code>~/.local/share/fcitx5/rime/default.custom.yaml</code>
</p>
<div class="org-src-container">
<pre class="src src-sh"><code>patch:
  menu/page_size: 9
  ascii_composer:
    switch_key/Caps_Lock: noop
  key_binder/bindings:
    - <span style="color: #ffffff;">{</span> when: has_menu, accept: comma, send: Page_Up <span style="color: #ffffff;">}</span>
    - <span style="color: #ffffff;">{</span> when: has_menu, accept: period, send: Page_Down <span style="color: #ffffff;">}</span>
</code></pre>
</div></li>
<li><p>
<code>~/.local/share/fcitx5/rime/wanxiang.custom.yaml</code>
</p>
<div class="org-src-container">
<pre class="src src-sh"><code>patch:
  switches:
    - name: ascii_mode                    <span style="color: #989898; font-style: italic;"># </span><span style="color: #989898; font-style: italic;">&#20013;&#33521;&#36755;&#20837;&#29366;&#24577;
</span>      states: <span style="color: #ffffff;">[</span> &#20013;&#25991;, &#33521;&#25991; <span style="color: #ffffff;">]</span>
      reset: 0
    - name: ascii_punct                   <span style="color: #989898; font-style: italic;"># </span><span style="color: #989898; font-style: italic;">&#20013;&#33521;&#26631;&#28857;&#65292;&#21487;&#20197;&#22312;&#20013;&#25991;&#36755;&#20837;&#29366;&#24577;&#36755;&#20837;&#33521;&#25991;&#31526;&#21495;
</span>      states: <span style="color: #ffffff;">[</span> &#20013;&#26631;, &#33521;&#26631; <span style="color: #ffffff;">]</span>
      reset: 0
    - name: full_shape                    <span style="color: #989898; font-style: italic;">#</span><span style="color: #989898; font-style: italic;">&#20840;&#35282;&#12289;&#21322;&#35282;&#23383;&#31526;&#36755;&#20986;
</span>      states: <span style="color: #ffffff;">[</span> &#21322;&#35282;, &#20840;&#35282; <span style="color: #ffffff;">]</span>
      reset: 0
    - name: simplification
      reset: 1
    - name: abbrev
      states: <span style="color: #ffffff;">[</span> &#31616;&#30721;&#20851;, &#31616;&#30721;&#24320; <span style="color: #ffffff;">]</span>
      reset: 1
    - options: <span style="color: #ffffff;">[</span>comment_off, tone_hint, toneless_hint<span style="color: #ffffff;">]</span>
      states: <span style="color: #ffffff;">[</span> &#27880;&#37322;&#20851;, &#26377;&#22768;&#35843;, &#26080;&#22768;&#35843; <span style="color: #ffffff;">]</span>
      reset: 1
</code></pre>
</div></li>
</ul>
</div>
</body>
</html>
